> [!IMPORTANT]  
> When _overriding_ disk attributes in a clone, keep in mind the default values of optional attributes in the disk schema. These defaults take precedence over the attributes in the source. In other words, a source attribute won’t automatically carry over to the clone if (a) there is a config section for the same disk in the clone, and (b) the attribute is omitted from the cloned disk config.

Can't reproduce in v0.73.2.

Using template (source: 20Gb, clone: 30Gb):
```hcl
resource "proxmox_virtual_environment_vm" "template" {
  node_name = "pve"
  started   = false
  disk {
    datastore_id = "local-lvm"
    interface    = "virtio0"
    file_format  = "raw"
    size         = 20
  }
}

resource "proxmox_virtual_environment_vm" "clone" {
  node_name = "pve"
  started   = false
  clone {
    vm_id = proxmox_virtual_environment_vm.template.vm_id
  }
  disk {
    datastore_id = "local-lvm"
    interface    = "virtio0"
    iothread     = true
    discard      = "on"
    size         = 30
    speed {
      iops_read = 100
      iops_read_burstable = 1000
      iops_write = 400
      iops_write_burstable = 800
    }
  }
}
```
```
❯ tofu apply -auto-approve
OpenTofu used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # proxmox_virtual_environment_vm.clone will be created
  + resource "proxmox_virtual_environment_vm" "clone" {
      + acpi                    = true
      + bios                    = "seabios"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + migrate                 = false
      + network_interface_names = (known after apply)
      + node_name               = "pve"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = false
      + stop_on_destroy         = false
      + tablet_device           = true
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = (known after apply)

      + clone {
          + full    = true
          + retries = 1
          + vm_id   = (known after apply)
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + discard           = "on"
          + file_format       = (known after apply)
          + interface         = "virtio0"
          + iothread          = true
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 30
          + ssd               = false

          + speed {
              + iops_read            = 100
              + iops_read_burstable  = 1000
              + iops_write           = 400
              + iops_write_burstable = 800
              + read                 = 0
              + read_burstable       = 0
              + write                = 0
              + write_burstable      = 0
            }
        }
    }

  # proxmox_virtual_environment_vm.template will be created
  + resource "proxmox_virtual_environment_vm" "template" {
      + acpi                    = true
      + bios                    = "seabios"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + migrate                 = false
      + network_interface_names = (known after apply)
      + node_name               = "pve"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = false
      + stop_on_destroy         = false
      + tablet_device           = true
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = (known after apply)

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + discard           = "ignore"
          + file_format       = "raw"
          + interface         = "virtio0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 20
          + ssd               = false
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
proxmox_virtual_environment_vm.template: Creating...
proxmox_virtual_environment_vm.template: Creation complete after 1s [id=101]
proxmox_virtual_environment_vm.clone: Creating...
proxmox_virtual_environment_vm.clone: Creation complete after 7s [id=102]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

```
Then updating clone to 35Gb:
```
❯ tofu apply -auto-approve
proxmox_virtual_environment_vm.template: Refreshing state... [id=101]
proxmox_virtual_environment_vm.clone: Refreshing state... [id=102]

OpenTofu used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

OpenTofu will perform the following actions:

  # proxmox_virtual_environment_vm.clone will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "clone" {
        id                      = "102"
        # (27 unchanged attributes hidden)

      ~ disk {
          ~ size              = 30 -> 35
            # (11 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
proxmox_virtual_environment_vm.clone: Modifying... [id=102]
proxmox_virtual_environment_vm.clone: Modifications complete after 2s [id=102]

Apply complete! Resources: 0 added, 1 changed, 0 destroyed.
```
<img width="1716" alt="Image" src="https://github.com/user-attachments/assets/7f8c25e4-dea6-49b4-b9b7-bdbd27a2be9b" />